#include "pch.h"

void 坐标过图(int 方向ID)
{
	INT64 一级偏移, 临时数据;
	INT64 坐标结构;
	一级偏移 = 读写_读长整数(人物基址);
	临时数据 = 读写_读长整数(房间编号);
	临时数据 = 读写_读长整数(临时数据 + 时间基址);
	临时数据 = 读写_读长整数(临时数据 + 顺图方向偏移);
	坐标结构 = 临时数据 + 方向ID * 方向坐标 + 坐标顺图;
	INT64 计算结构[6];
	计算结构[0] = 读写_读长整数(坐标结构 + 0);
	计算结构[1] = 读写_读长整数(坐标结构 + 4);
	计算结构[2] = 读写_读长整数(坐标结构 + 8);
	计算结构[3] = 读写_读长整数(坐标结构 + 12);
	if (方向ID == 0)
	{
		计算结构[4] = 计算结构[0] + 计算结构[2] + 20;
		计算结构[5] = 计算结构[1] + 计算结构[3] / 2;
	}
	else if (方向ID == 1)
	{
		计算结构[4] = 计算结构[0] - 20;
		计算结构[5] = 计算结构[1] + 计算结构[3] / 2;
	}
	else if (方向ID == 2)
	{
		计算结构[4] = 计算结构[0] + 计算结构[2] / 2;
		计算结构[5] = 计算结构[1] + 计算结构[3] + 20;
	}
	else if (方向ID == 3)
	{
		计算结构[4] = 计算结构[0] + 计算结构[2] / 2;
		计算结构[5] = 计算结构[1] - 20;
	}
	坐标call(一级偏移, 计算结构[4], 计算结构[5], 0);
	Sleep(200);
	坐标call(一级偏移, 计算结构[0] + 计算结构[2] / 2, 计算结构[1], 0);
}

void 组包顺图(int 坐标值)
{
	if (坐标值 == 0)
	{
		组包_过图(汇编_减(全局_收包数据.参_当前坐标.参_横轴坐标, 1), 全局_收包数据.参_当前坐标.参_纵轴坐标);
	}
	if (坐标值 == 1)
	{
		组包_过图(汇编_加(全局_收包数据.参_当前坐标.参_横轴坐标, 1), 全局_收包数据.参_当前坐标.参_纵轴坐标);
	}
	if (坐标值 == 2)
	{
		组包_过图(全局_收包数据.参_当前坐标.参_横轴坐标, 汇编_减(全局_收包数据.参_当前坐标.参_纵轴坐标, 1));
	}
	if (坐标值 == 3)
	{
		组包_过图(全局_收包数据.参_当前坐标.参_横轴坐标, 汇编_加(全局_收包数据.参_当前坐标.参_纵轴坐标, 1));
	}
}




int 皇宫全图()
{
	if (全局_收包数据.参_领主坐标.参_横轴坐标 == 1 && 全局_收包数据.参_领主坐标.参_纵轴坐标 == 4)
	{
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 1 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 0)
		{
			return 0;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 0 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 0)
		{
			return 3;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 0 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 1)
		{
			return 1;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 1 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 1)
		{
			return 1;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 2 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 1)
		{
			if (全局_自动.全_回走 == 0)
			{
				全局_自动.全_回走 = 1;
				return 2;
			}
			else
			{
				全局_自动.全_回走 = 0;
				return 3;
			}
			return 2;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 2 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 0)
		{
			return 3;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 2 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 2)
		{
			return 0;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 1 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 2)
		{
			return 0;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 0 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 3)
		{
			if (全局_自动.全_回走 == 0)
			{
				全局_自动.全_回走 = 1;
				return 3;
			}
			else
			{
				全局_自动.全_回走 = 0;
				return 1;
			}
			return 3;
		}
		if(全局_收包数据.参_当前坐标.参_横轴坐标 == 0 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 2)
		{
			return 3;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 0 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 4)
		{
			return 2;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 1 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 3)
		{
			return 1;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 2 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 3)
		{
			return 3;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 2 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 4)
		{
			return 0;
		}
	}
	if (全局_收包数据.参_领主坐标.参_横轴坐标 == 1 && 全局_收包数据.参_领主坐标.参_纵轴坐标 == 0)
	{
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 1 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 4)
		{
			return 0;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 0 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 4)
		{
			return 2;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 0 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 3)
		{
			return 1;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 1 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 3)
		{
			return 1;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 2 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 3)
		{
			if (全局_自动.全_回走 == 0)
			{
				全局_自动.全_回走 = 1;
				return 3;
			}
			else
			{
				全局_自动.全_回走 = 0;
				return 2;
			}
			return 3;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 2 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 4)
		{
			return 2;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 2 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 2)
		{
			return 0;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 1 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 2)
		{
			return 0;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 0 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 2)
		{
			return 2;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 0 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 1)
		{
			if (全局_自动.全_回走 == 0)
			{
				全局_自动.全_回走 = 1;
				return 2;
			}
			else
			{
				全局_自动.全_回走 = 0;
				return 1;
			}
			return 2;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 0 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 0)
		{
			return 3;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 1 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 1)
		{
			return 1;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 2 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 1)
		{
			return 2;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 2 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 0)
		{
			return 0;
		}
	}
	if (全局_收包数据.参_领主坐标.参_横轴坐标 == 4 && 全局_收包数据.参_领主坐标.参_纵轴坐标 == 2)
	{
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 0 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 2)
		{
			return 1;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 1 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 2)
		{
			return 2;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 1 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 1)
		{
			return 0;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 0 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 1)
		{
			return 2;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 0 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 0)
		{
			return 1;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 1 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 0)
		{
			return 1;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 2 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 0)
		{
			return 1;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 3 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 0)
		{
			return 3;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 3 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 1)
		{
			return 3;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 3 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 2)
		{
			return 1;
		}
	}
	if (全局_收包数据.参_领主坐标.参_横轴坐标 == 0 && 全局_收包数据.参_领主坐标.参_纵轴坐标 == 0)
	{
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 4 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 0)
		{
			return 0;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 3 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 0)
		{
			return 3;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 3 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 1)
		{
			return 1;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 4 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 1)
		{
			return 3;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 4 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 2)
		{
			return 0;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 3 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 2)
		{
			return 0;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 2 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 2)
		{
			return 0;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 1 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 2)
		{
			return 2;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 1 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 1)
		{
			return 2;
		}
		if (全局_收包数据.参_当前坐标.参_横轴坐标 == 1 && 全局_收包数据.参_当前坐标.参_纵轴坐标 == 0)
		{
			return 0;
		}
	}
	return -1;
}